:PROPERTIES:
:ID:       1425ac44-6197-4582-ab08-d767997e0158
:END:
#+title: Python syntax

* reconstruction =for=-=break= into =while x :=break_contition=
secure with better initialization, and catch exceptions with if statement afterwards
#+BEGIN_SRC python :results output :exports both :session arst
position = -1
for position in range(len(sample_2)):
    if sample_2[position] in '=:':
        break

if position == -1:
    print(f"name=None value=None")
elif not(sample_2[position] == ':' or sample_2[position] =='='):
    print(f"name={sample_2!r} value=None")
else:
    print(f"name={sample_2[:position]!r}",
    f"value={sample_2[position+1:]!r}")
#+END_SRC

#+RESULTS:
: name=None value=None

* move exception condition processing forward
best but hardest solution
#+BEGIN_SRC python :results output :exports both :session arst
if len(sample_2) > 0:
    name, value = sample_2, None
else:
    name, value = None, None
for position in range(len(sample_2)):
    if sample_2[position] in '=:':
        name, value = sample_2[:position], sample2[position:]
        break
print(f"{name=} {value=}")
#+END_SRC

#+RESULTS:
: name=None value=None

* Exit with an exception pending
The context manager will—under all conditions—disentangle our program from external resources.
#+BEGIN_SRC python :results output :exports both :session arst
import csv
from pathlib import Path
some_source = [[3,2,3],[1,1,1],[2,3,4]]
target_path = Path.cwd()/"test.csv"
try:
    with target_path.open('w', newline='') as target_file:
        writer = csv.writer(target_file)
        writer.writerow(['column', 'data', 'heading'])
        writer.writerow(some_source[0])
        raise Exception("Testing")
except Exception as exc:
    print(f"{target_file.closed=}")
    print(f"{exc=}")
print(f"Finished Writing {target_path.name}")

out = """
target_file.closed=True
exc=Exception('Testing')
Finished Writing test.csv
"""
#+END_SRC

#+RESULTS:
: target_file.closed=True
: exc=Exception('Testing')
: Finished Writing test.csv

